In [2]:
import sqlite3
import pandas as pd
import numpy as np
con = sqlite3.connect("..\\data\\tutorial.db")

In [3]:
cur = con.cursor()

In [14]:
cur.execute("CREATE TABLE movie(title, year, score)")

In [15]:
res = cur.execute("SELECT name FROM sqlite_master")
res.fetchone()

('movie',)

In [16]:
res = cur.execute("SELECT name FROM sqlite_master WHERE name='spam'")
res.fetchone() is None

True

In [17]:
cur.execute("""
    INSERT INTO movie VALUES
        ('Monty Python and the Holy Grail', '1975/01/02', 8.2),
        ('And Now for Something Completely Different', '1971/03/04', 7.5)
""")

In [18]:
con.commit()

In [19]:
res = cur.execute("SELECT score FROM movie")
res.fetchall()

[(8.2,), (7.5,)]

In [20]:
data = [
    ("Monty Python Live at the Hollywood Bowl", '1982/05/06', 7.9),
    ("Monty Python's The Meaning of Life", '1983/07/08', 7.5),
    ("Monty Python's Life of Brian", '1979/08/09', 8.0),
]
cur.executemany("INSERT INTO movie VALUES(?, ?, ?)", data)
con.commit()  # Remember to commit the transaction after executing INSERT.

### With Pandas

In [23]:
df = pd.read_sql("select * from movie", con)
df

                                        title        year  score
0             Monty Python and the Holy Grail  1975/01/02    8.2
1  And Now for Something Completely Different  1971/03/04    7.5
2     Monty Python Live at the Hollywood Bowl  1982/05/06    7.9
3          Monty Python's The Meaning of Life  1983/07/08    7.5
4                Monty Python's Life of Brian  1979/08/09    8.0

In [24]:
df=df.append(pd.DataFrame(data = {'title':['pandas reading results'], 'year':['2023/04/05'], 'score':[9]}))
df

                                        title        year  score
0             Monty Python and the Holy Grail  1975/01/02    8.2
1  And Now for Something Completely Different  1971/03/04    7.5
2     Monty Python Live at the Hollywood Bowl  1982/05/06    7.9
3          Monty Python's The Meaning of Life  1983/07/08    7.5
4                Monty Python's Life of Brian  1979/08/09    8.0
0                      pandas reading results  2023/04/05    9.0

In [25]:
df.to_sql('movie', con, if_exists='replace', index=False) # or append

In [26]:
res = cur.execute("SELECT * FROM movie")
res.fetchall()

[('Monty Python and the Holy Grail', '1975/01/02', 8.2),
 ('And Now for Something Completely Different', '1971/03/04', 7.5),
 ('Monty Python Live at the Hollywood Bowl', '1982/05/06', 7.9),
 ("Monty Python's The Meaning of Life", '1983/07/08', 7.5),
 ("Monty Python's Life of Brian", '1979/08/09', 8.0),
 ('pandas reading results', '2023/04/05', 9.0)]

In [13]:
# cur.execute('drop table movie')
# con.commit()